{
  "skills": [
    {
      "group": "The Basics",
      "entries": [
        {
          "name": "HTML5",
          "summary": "First encountered HTML at an early age, worked with it throughout career. Strict on keeping the markup void of implied styling in favour of maximum semantic meaning. Familiar with HTML5 - new elements, new input types, HTML5 video for example.",
          "experience": "Excellent. Utilised in every project."
        },
        {
          "name": "CSS3",
          "summary": "Prefer to use the SMACSS model where possible for good modularity and scalability. Experienced at troubleshooting cross-browser presentation issues. Proficient with media queries and CSS3 animation.",
          "experience": ""
        },
        {
          "name": "Sass / LESS",
          "summary": "Equally capable with both, have used both commercially. Happy with nested styles and inheritance, writing variables, mixins, functions, etc.",
          "experience": ""
        },
        {
          "name": "JavaScript",
          "summary": "Compentent object-oriented JavaScript developer - functions, objects, classes, prototype, etc. Have experience with a wide range of projects with different levels of JavaScript involvement, from web pages requiring mere form validation to large complex webapps driven 90% by JavaScript.",
          "experience": ""
        }
      ]
    },
    {
      "group": "JS Libraries / Frameworks",
      "entries": [
        {
          "name": "AngularJS",
          "summary": "Strong knowledge of AngularJS fundamentals and best practices - controllers, directives, services, routing, isolate scope, etc. I have a non-trivial sample application for inspection that can be found on the Code Samples page.",
          "experience": ""
        },
        {
          "name": "Backbone.js",
          "summary": "Excellent understanding and familiarity with the framework - views, models, collections, routers, etc. I have a handful of projects available for review on the Portfolio page that have been built with Backbone.js.",
          "experience": ""
        },
        {
          "name": "Flight",
          "summary": "",
          "experience": ""
        },
        {
          "name": "jQuery",
          "summary": "Long-standing famliarity. Used to one extent or another on virtually every project. Have also experimented with jQuery UI on past projects.",
          "experience": ""
        },
        {
          "name": "Underscore.js / Lodash",
          "summary": "More recently preferring Lodash, I sometimes call upon a utility library such as these for general array and object manipulation tasks.",
          "experience": ""
        },
        {
          "name": "Modernizr",
          "summary": "Have deployed many times when extensive feature detection has been necessary on a project. Have often detected features and implemented change via both CSS and JavaScript.",
          "experience": ""
        }
      ]
    },
    {
      "group": "UI Frameworks / Grid Systems",
      "entries": [
        {
          "name": "Twitter Bootstrap",
          "summary": "Adept with the grid system in order to bring about a responsive front-end. Also experienced with the various CSS/JS components provided such as Bootstrap's carousel, accordion, tabs, etc.",
          "experience": ""
        },
        {
          "name": "Foundation",
          "summary": "",
          "experience": "Equally familiar with the accompanying grid system for scaffolding purposes, which prior to Bootstrap 3.0 was the more flexible system. Also experienced with Foundation's interchange function as a responsive images solution."
        },
        {
          "name": "Susy",
          "summary": "Sass-driven grid system and my preferred solution. Susy and other pre-processor solutions like it, trump the others on flexibility and control. Provides cleaner and more meaningful HTML markup, as well as an easier method for customising.",
          "experience": ""
        }
      ]
    },
    {
      "group": "Templating",
      "entries": [
        {
          "name": "Handlebars",
          "summary": "Fair experience with templating library and have used commercially. Familiar with general syntax and creating custom helper functions.",
          "experience": ""
        },
        {
          "name": "Mustache",
          "summary": "",
          "experience": ""
        }
      ]
    },
    {
      "group": "Module Systems",
      "entries": [
        {
          "name": "Webpack",
          "summary": "",
          "experience": ""
        },
        {
          "name": "Require.js",
          "summary": "Good project experience of using library for modular and optmial architecture. Familiar with the r.js optimiser, and AMD substitute almond.js, for building require.js apps for production environments.",
          "experience": ""
        },
        {
          "name": "Browserify",
          "summary": "",
          "experience": ""
        }
      ]
    },
    {
      "group": "Developer Workflow",
      "entries": [
        {
          "name": "Git Version Control",
          "summary": "Good knowledge of working with Git via command line. Familiar with Gitflow model - feature branches, release branches, pull requests, hotfixing, etc.",
          "experience": ""
        },
        {
          "name": "Gulp",
          "summary": "",
          "experience": ""
        },
        {
          "name": "Grunt",
          "summary": "I use Grunt to automate a range of tasks such as JavaScript linting, compiling Sass/LESS styles, generating spritesheets, browser auto-reloading, etc. Have recently produced a comprehensive build process for Backbone.js/Require.js apps that compiles to a highly optimised state that I use for projects with such requirements.",
          "experience": ""
        },
        {
          "name": "NPM / Bower",
          "summary": "Very comfortable using either package manager for importing and organising app dependencies and development tools.",
          "experience": ""
        },
        {
          "name": "Yeoman",
          "summary": "Yeoman's flagship generator, 'webapp-generator', is useful for simple landing pages or very small three to four page static sites.",
          "experience": ""
        }
      ]
    },
    {
      "group": "Testing",
      "entries": [
        {
          "name": "Jasmine",
          "summary": "Very comfortable with the overall syntax for defining tests and test suites. Currently in the process of extending my unit testing knowledge to cover the test runner Karma, spies with Sinon.js, and Protractor for testing AngularJS applications.",
          "experience": ""
        },
        {
          "name": "Mocha",
          "summary": "",
          "experience": ""
        },
        {
          "name": "Karma",
          "summary": "",
          "experience": ""
        },
        {
          "name": "PhantomJS",
          "summary": "",
          "experience": ""
        },
        {
          "name": "PhantomCSS",
          "summary": "",
          "experience": ""
        },
        {
          "name": "PHPUnit",
          "summary": "As part of being responsible for the full stack of applications in the past (see next section 'Server-side Development'), I have previously resorted to PHPUnit for unit testing purposes.",
          "experience": ""
        }
      ]
    },
    {
      "group": "Server-Side Development",
      "entries": [
        {
          "name": "NodeJS",
          "summary": "",
          "experience": ""
        },
        {
          "name": "MongoDB",
          "summary": "",
          "experience": ""
        },
        {
          "name": "PHP",
          "summary": "Have often been responsible for the full stack of a website with server-side requirements. Good grasp of Classes, Functions, Scope, Error Handling, etc, as well as working within a PHP framework.",
          "experience": ""
        },
        {
          "name": "MySQL",
          "summary": "Predominantly used MySQL as the database solution for PHP projects. Good level of SQL knowledge. Comfortable managing databases via command line or tools such as Sequel Pro/MySQL Workbench.",
          "experience": ""
        },
        {
          "name": "Laravel",
          "summary": "Good grasp of framework essentials. Competent with writing routes, creating RESTful controllers, views, models, databases, and working with the PHP artisan command line tool. Have also written unit tests with the in-built PHPUnit library.",
          "experience": ""
        },
        {
          "name": "CodeIgniter",
          "summary": "Strong commercial experience as CodeIgniter was a standard where I worked for over two years. Knowledgeable of views, controllers, models, routes, database integration, custom configuration, extending base classes, language translation, etc.",
          "experience": ""
        }
      ]
    },
    {
      "group": "Miscellaneous",
      "entries": [
        {
          "name": "Sketch",
          "summary": "",
          "experience": ""
        },
        {
          "name": "Adobe Photoshop",
          "summary": "",
          "experience": ""
        },
        {
          "name": "Adobe Flash",
          "summary": "",
          "experience": ""
        },
        {
          "name": "Adobe Fireworks",
          "summary": "",
          "experience": ""
        }
      ]
    }
  ]
}
